
## :x: Apply Failed

[CI link](https://github.com/hayas1/tfgh/actions/runs/11857411526)



<pre><code>Error: refusing to overwrite existing file: configure `overwrite_on_create` to `true` to override

  with module.repositories[&#34;tfgh&#34;].github_repository_file.readme,
  on module/repository/files.tf line 12, in resource &#34;github_repository_file&#34; &#34;readme&#34;:
  12: resource &#34;github_repository_file&#34; &#34;readme&#34; {


Error: refusing to overwrite existing file: configure `overwrite_on_create` to `true` to override

  with module.repositories[&#34;devcontainer-features&#34;].github_repository_file.readme,
  on module/repository/files.tf line 12, in resource &#34;github_repository_file&#34; &#34;readme&#34;:
  12: resource &#34;github_repository_file&#34; &#34;readme&#34; {


Error: refusing to overwrite existing file: configure `overwrite_on_create` to `true` to override

  with module.repositories[&#34;dyson-rs&#34;].github_repository_file.readme,
  on module/repository/files.tf line 12, in resource &#34;github_repository_file&#34; &#34;readme&#34;:
  12: resource &#34;github_repository_file&#34; &#34;readme&#34; {


Error: refusing to overwrite existing file: configure `overwrite_on_create` to `true` to override

  with module.repositories[&#34;json-with-comments&#34;].github_repository_file.readme,
  on module/repository/files.tf line 12, in resource &#34;github_repository_file&#34; &#34;readme&#34;:
  12: resource &#34;github_repository_file&#34; &#34;readme&#34; {

::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.repositories["devcontainer-features"].github_repository.this: Refreshing state... [id=devcontainer-features]
module.repositories["tfgh"].github_repository.this: Refreshing state... [id=tfgh]
module.repositories["json-with-comments"].github_repository.this: Refreshing state... [id=json-with-comments]
module.repositories["dyson-rs"].github_repository.this: Refreshing state... [id=dyson-rs]
module.repositories["dyson-rs"].github_branch.default: Refreshing state... [id=dyson-rs:master]
module.repositories["devcontainer-features"].github_branch.default: Refreshing state... [id=devcontainer-features:main]
module.repositories["json-with-comments"].github_branch.default: Refreshing state... [id=json-with-comments:master]
module.repositories["tfgh"].github_branch.default: Refreshing state... [id=tfgh:main]
module.repositories["devcontainer-features"].github_issue_label.this["deps"]: Refreshing state... [id=devcontainer-features:deps]
module.repositories["tfgh"].github_repository_ruleset.this: Refreshing state... [id=2558597]
module.repositories["devcontainer-features"].github_repository_ruleset.this: Refreshing state... [id=2602488]
module.repositories["dyson-rs"].github_repository_ruleset.this: Refreshing state... [id=2589508]
module.repositories["devcontainer-features"].github_issue_label.this["feature"]: Refreshing state... [id=devcontainer-features:feature]
module.repositories["dyson-rs"].github_issue_label.this["refactor"]: Refreshing state... [id=dyson-rs:refactor]
module.repositories["devcontainer-features"].github_issue_label.this["maintenance"]: Refreshing state... [id=devcontainer-features:maintenance]
module.repositories["dyson-rs"].github_issue_label.this["breaking"]: Refreshing state... [id=dyson-rs:breaking]
module.repositories["devcontainer-features"].github_issue_label.this["breaking"]: Refreshing state... [id=devcontainer-features:breaking]
module.repositories["dyson-rs"].github_issue_label.this["feature"]: Refreshing state... [id=dyson-rs:feature]
module.repositories["tfgh"].github_issue_label.this["deps"]: Refreshing state... [id=tfgh:deps]
module.repositories["devcontainer-features"].github_issue_label.this["refactor"]: Refreshing state... [id=devcontainer-features:refactor]
module.repositories["tfgh"].github_issue_label.this["refactor"]: Refreshing state... [id=tfgh:refactor]
module.repositories["tfgh"].github_issue_label.this["feature"]: Refreshing state... [id=tfgh:feature]
module.repositories["dyson-rs"].github_issue_label.this["deps"]: Refreshing state... [id=dyson-rs:deps]
module.repositories["dyson-rs"].github_issue_label.this["bugfix"]: Refreshing state... [id=dyson-rs:bugfix]
module.repositories["devcontainer-features"].github_issue_label.this["documentation"]: Refreshing state... [id=devcontainer-features:documentation]
module.repositories["devcontainer-features"].github_issue_label.this["bugfix"]: Refreshing state... [id=devcontainer-features:bugfix]
module.repositories["dyson-rs"].github_issue_label.this["documentation"]: Refreshing state... [id=dyson-rs:documentation]
module.repositories["dyson-rs"].github_issue_label.this["maintenance"]: Refreshing state... [id=dyson-rs:maintenance]
module.repositories["tfgh"].github_issue_label.this["breaking"]: Refreshing state... [id=tfgh:breaking]
module.repositories["tfgh"].github_issue_label.this["documentation"]: Refreshing state... [id=tfgh:documentation]
module.repositories["tfgh"].github_issue_label.this["maintenance"]: Refreshing state... [id=tfgh:maintenance]
module.repositories["tfgh"].github_issue_label.this["bugfix"]: Refreshing state... [id=tfgh:bugfix]
module.repositories["dyson-rs"].github_branch_default.this: Refreshing state... [id=dyson-rs]
module.repositories["tfgh"].github_branch_default.this: Refreshing state... [id=tfgh]
module.repositories["devcontainer-features"].github_branch_default.this: Refreshing state... [id=devcontainer-features]
module.repositories["json-with-comments"].github_branch_default.this: Refreshing state... [id=json-with-comments]
module.repositories["tfgh"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tfgh/.github/release.yml]
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tfgh/.github/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/workflows/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tfgh/.github/issue_template.md]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tfgh/.github/pull_request_template.md]
module.repositories["tfgh"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tfgh/.github/workflows/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/workflows/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=devcontainer-features/.github/issue_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=devcontainer-features/.github/pull_request_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=devcontainer-features/.github/release.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=dyson-rs/.github/pull_request_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=dyson-rs/.github/issue_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=dyson-rs/.github/release.yml]
module.repositories["tfgh"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tfgh:65]
module.repositories["dyson-rs"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:dyson-rs:9]
module.repositories["devcontainer-features"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:devcontainer-features:42]
github_repository_environment.plan: Refreshing state... [id=tfgh:plan]
github_issue_label.manual: Refreshing state... [id=tfgh:manual]
github_repository_environment.apply: Refreshing state... [id=tfgh:apply]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"198b6aa2db0aa28d6c3ad241d758cf7a7aea5682cda2007a5bebc85d2aa8bfb7\"" -> "W/\"28b364cc8371dfcd18d77c5ccfaa2416da84d4fd011f95e5a371b4b163a41cf0\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"1092af11d1fd6e4e70805a81eee222fe06fbfdf24356647d0948cef34c252df4\"" -> "W/\"a5471ab2699facfa573982ef72db6b7e37f9f5422e7c9bad97ab86b385c7ff60\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["json-with-comments"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"c5a3feb50fa80023d3dac0a04ef12df4eb337cff6d2caa4809c6a3c34dd60772\"" -> "W/\"32b62b502e55970b5c20bf115e9752750ba9a60b6ef9865914ebc601e2ae19c9\""
        id                          = "json-with-comments"
        name                        = "json-with-comments"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"f276744125ab03822db11bad4795b447938c2f2aaa92e051b12b941408d87fdd\"" -> "W/\"131bf056cfc9e6ff1ed827b4253bb81d86ecb0c0f6e4be70e24a0d6f75ae1032\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.repositories["devcontainer-features"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: README.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # devcontainer-features
            devcontainer features
        EOT
      + file                            = "README.md"
      + id                              = (known after apply)
      + overwrite_on_create             = false
      + ref                             = (known after apply)
      + repository                      = "devcontainer-features"
      + sha                             = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Expectation :butterfly:
            > What behavior is expected?
            
            # Reality :bug:
            > How does it actually work?
            
            # Environment :evergreen_tree:
            > (When and) Where the behavior was observed?
            
            # Cause :mag:
            > Why this issue was occurred?
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/labeler.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
      + file                         = ".github/labeler.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/pull_request_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Overview :rocket:
            > What is this pull request?
            
            # Implementation :clamp:
            > How to realize ?
            
            # Use cases :chopsticks:
            > Why this pull request was created?
            
            # Testing :gear:
            > Testing steps
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                         = ".github/pull_request_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/release.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
      + file                         = ".github/release.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                         = ".github/workflows/labeler.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["dyson-rs"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: README.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # dyson-rs
        EOT
      + file                            = "README.md"
      + id                              = (known after apply)
      + overwrite_on_create             = false
      + ref                             = (known after apply)
      + repository                      = "dyson-rs"
      + sha                             = (known after apply)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Expectation :butterfly:
            > What behavior is expected?
            
            # Reality :bug:
            > How does it actually work?
            
            # Environment :evergreen_tree:
            > (When and) Where the behavior was observed?
            
            # Cause :mag:
            > Why this issue was occurred?
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "dyson-rs"
      + sha                          = (known after apply)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
            # Overview :rocket:
          - > What is this pull request ?
          + > What is this pull request?
            
            # Implementation :clamp:
            > How to realize ?
            
            # Use cases :chopsticks:
          - > Why this pull request was created ?
          + > Why this pull request was created?
            
            # Testing :gear:
            > Testing steps
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
        id                              = "dyson-rs/.github/pull_request_template.md"
        # (11 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "85efb7504f0ecf81987c8c3c9737b75deb820ae6" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "03c8e6ddda6892d820af7e92128cacc2edffcc25" -> (known after apply)
      ~ id                    = "hayas1:dyson-rs:9" -> (known after apply)
      ~ labels                = [
          - "documentation",
        ] -> (known after apply)
      ~ number                = 9 -> (known after apply)
      ~ opened_at             = 1731424405 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "closed" -> (known after apply)
      ~ updated_at            = 1731514005 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_issue_label.this["breaking"] will be created
  + resource "github_issue_label" "this" {
      + color       = "F84AD4"
      + description = "Containing breaking changes"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "breaking"
      + repository  = "json-with-comments"
      + url         = (known after apply)
    }

  # module.repositories["json-with-comments"].github_issue_label.this["bugfix"] will be created
  + resource "github_issue_label" "this" {
      + color       = "DE3659"
      + description = "Fix some bugs"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "bugfix"
      + repository  = "json-with-comments"
      + url         = (known after apply)
    }

  # module.repositories["json-with-comments"].github_issue_label.this["deps"] will be created
  + resource "github_issue_label" "this" {
      + color       = "36BF46"
      + description = "Dependency updates"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "deps"
      + repository  = "json-with-comments"
      + url         = (known after apply)
    }

  # module.repositories["json-with-comments"].github_issue_label.this["documentation"] will be created
  + resource "github_issue_label" "this" {
      + color       = "0075CA"
      + description = "Documentation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "documentation"
      + repository  = "json-with-comments"
      + url         = (known after apply)
    }

  # module.repositories["json-with-comments"].github_issue_label.this["feature"] will be created
  + resource "github_issue_label" "this" {
      + color       = "008B75"
      + description = "New feature"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "feature"
      + repository  = "json-with-comments"
      + url         = (known after apply)
    }

  # module.repositories["json-with-comments"].github_issue_label.this["maintenance"] will be created
  + resource "github_issue_label" "this" {
      + color       = "7F6054"
      + description = "No effect on codebase"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "maintenance"
      + repository  = "json-with-comments"
      + url         = (known after apply)
    }

  # module.repositories["json-with-comments"].github_issue_label.this["refactor"] will be created
  + resource "github_issue_label" "this" {
      + color       = "BA5798"
      + description = "Refactoring"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "refactor"
      + repository  = "json-with-comments"
      + url         = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      - has_downloads               = true -> null
        id                          = "json-with-comments"
        name                        = "json-with-comments"
      - vulnerability_alerts        = true -> null
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: README.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # json-with-comments
            JSONC library for Rust
        EOT
      + file                            = "README.md"
      + id                              = (known after apply)
      + overwrite_on_create             = false
      + ref                             = (known after apply)
      + repository                      = "json-with-comments"
      + sha                             = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Expectation :butterfly:
            > What behavior is expected?
            
            # Reality :bug:
            > How does it actually work?
            
            # Environment :evergreen_tree:
            > (When and) Where the behavior was observed?
            
            # Cause :mag:
            > Why this issue was occurred?
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "json-with-comments"
      + sha                          = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/labeler.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
      + file                         = ".github/labeler.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "json-with-comments"
      + sha                          = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/pull_request_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Overview :rocket:
            > What is this pull request?
            
            # Implementation :clamp:
            > How to realize ?
            
            # Use cases :chopsticks:
            > Why this pull request was created?
            
            # Testing :gear:
            > Testing steps
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                         = ".github/pull_request_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "json-with-comments"
      + sha                          = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/release.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/release.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
      + file                         = ".github/release.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "json-with-comments"
      + sha                          = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                         = ".github/workflows/labeler.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "json-with-comments"
      + sha                          = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository_pull_request.managed will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "master"
      + base_repository       = "json-with-comments"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "[auto] snippet files managed by Terraform"
      + updated_at            = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository_ruleset.this will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "default"
      + node_id     = (known after apply)
      + repository  = "json-with-comments"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + non_fast_forward              = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

  # module.repositories["tfgh"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: README.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # tfgh
            managed by terraform
        EOT
      + file                            = "README.md"
      + id                              = (known after apply)
      + overwrite_on_create             = false
      + ref                             = (known after apply)
      + repository                      = "tfgh"
      + sha                             = (known after apply)
    }

  # module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Expectation :butterfly:
            > What behavior is expected?
            
            # Reality :bug:
            > How does it actually work?
            
            # Environment :evergreen_tree:
            > (When and) Where the behavior was observed?
            
            # Cause :mag:
            > Why this issue was occurred?
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "tfgh"
      + sha                          = (known after apply)
    }

Plan: 26 to add, 2 to change, 1 to destroy.
module.repositories["dyson-rs"].github_repository_pull_request.managed: Destroying... [id=hayas1:dyson-rs:9]
module.repositories["dyson-rs"].github_repository_pull_request.managed: Destruction complete after 0s
module.repositories["json-with-comments"].github_repository.this: Modifying... [id=json-with-comments]
module.repositories["json-with-comments"].github_repository.this: Modifications complete after 3s [id=json-with-comments]
module.repositories["json-with-comments"].github_issue_label.this["maintenance"]: Creating...
module.repositories["dyson-rs"].github_repository_file.readme: Creating...
module.repositories["json-with-comments"].github_issue_label.this["deps"]: Creating...
module.repositories["json-with-comments"].github_issue_label.this["feature"]: Creating...
module.repositories["tfgh"].github_repository_file.readme: Creating...
module.repositories["json-with-comments"].github_issue_label.this["documentation"]: Creating...
module.repositories["json-with-comments"].github_issue_label.this["breaking"]: Creating...
module.repositories["devcontainer-features"].github_repository_file.readme: Creating...
module.repositories["json-with-comments"].github_repository_file.readme: Creating...
module.repositories["json-with-comments"].github_repository_ruleset.this: Creating...
module.repositories["json-with-comments"].github_repository_ruleset.this: Creation complete after 8s [id=2629668]
module.repositories["json-with-comments"].github_issue_label.this["refactor"]: Creating...
module.repositories["json-with-comments"].github_issue_label.this["maintenance"]: Creation complete after 9s [id=json-with-comments:maintenance]
module.repositories["json-with-comments"].github_issue_label.this["bugfix"]: Creating...
module.repositories["json-with-comments"].github_issue_label.this["breaking"]: Creation complete after 10s [id=json-with-comments:breaking]
module.repositories["json-with-comments"].github_issue_label.this["documentation"]: Creation complete after 10s [id=json-with-comments:documentation]
module.repositories["dyson-rs"].github_repository_file.readme: Still creating... [10s elapsed]
module.repositories["json-with-comments"].github_issue_label.this["deps"]: Still creating... [10s elapsed]
module.repositories["json-with-comments"].github_issue_label.this["feature"]: Still creating... [10s elapsed]
module.repositories["devcontainer-features"].github_repository_file.readme: Still creating... [10s elapsed]
module.repositories["tfgh"].github_repository_file.readme: Still creating... [10s elapsed]
module.repositories["json-with-comments"].github_repository_file.readme: Still creating... [10s elapsed]
module.repositories["json-with-comments"].github_issue_label.this["feature"]: Creation complete after 12s [id=json-with-comments:feature]
module.repositories["json-with-comments"].github_issue_label.this["deps"]: Creation complete after 12s [id=json-with-comments:deps]
module.repositories["json-with-comments"].github_issue_label.this["refactor"]: Creation complete after 9s [id=json-with-comments:refactor]
module.repositories["json-with-comments"].github_issue_label.this["bugfix"]: Creation complete after 8s [id=json-with-comments:bugfix]

Error: refusing to overwrite existing file: configure `overwrite_on_create` to `true` to override

  with module.repositories["tfgh"].github_repository_file.readme,
  on module/repository/files.tf line 12, in resource "github_repository_file" "readme":
  12: resource "github_repository_file" "readme" {


Error: refusing to overwrite existing file: configure `overwrite_on_create` to `true` to override

  with module.repositories["devcontainer-features"].github_repository_file.readme,
  on module/repository/files.tf line 12, in resource "github_repository_file" "readme":
  12: resource "github_repository_file" "readme" {


Error: refusing to overwrite existing file: configure `overwrite_on_create` to `true` to override

  with module.repositories["dyson-rs"].github_repository_file.readme,
  on module/repository/files.tf line 12, in resource "github_repository_file" "readme":
  12: resource "github_repository_file" "readme" {


Error: refusing to overwrite existing file: configure `overwrite_on_create` to `true` to override

  with module.repositories["json-with-comments"].github_repository_file.readme,
  on module/repository/files.tf line 12, in resource "github_repository_file" "readme":
  12: resource "github_repository_file" "readme" {

::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":66,"Program":"tfcmt","SHA1":"cf04f4a581d2199214e5f53e2d843522ae6b669d","Vars":{},"WorkflowName":"Terraform apply on push"} -->